Repository: jolly-jump/qmlbook
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de

source: A Book about Qt5
de: Ein Buch über Qt5.

source: Last Build: |today|
de: Letzter Build: |today|

source: Welcome to the online book of Qt5 Cadaques! Why Qt5? Because Qt5 is awesome! Why cadaques? Because one of the authors had a great holiday in this rocky coast line in the north-east of spain.
de: Willkommen zum online Buch der Qt5 Cadaques! Warum Qt5? Weil Qt5 einfach geil ist! Warum Cadaques? Weil einer der Autoren einen großartigen Urlaub an dieser steinigen Küstenlinie im Nordosten Spaniens verbrachte.

source: The entire collection of chapters covering Qt5 programming, written by Juergen Bocklage-Ryannel and Johan Thelin, is available here. All book content is licensed under the `Creative Commons Attribution Non Commercial Share Alike 4.0 <http://creativecommons.org/licenses/by-nc/4.0>`_ license and examples are licensed under the `BSD <http://en.wikipedia.org/wiki/BSD_licenses>`_ license.
de: Diese Sammlung an Kapiteln über Qt5 Programmierung wurde von Juergen Bocklage-Ryannel und Johan Thelin geschrieben und ist hier verfügbar. Der gesamte Buchinhalt ist lizensiert unter der `Creative Commons Attribution Non Commercial Share Alike 4.0 <http://creativecommons.org/licenses/by-nc/4.0>`_ Lizenz und die Beispiele sind lizensiert unter der `BSD <http://en.wikipedia.org/wiki/BSD_licenses>`_ Lizenz.

source: We are heavily working on this book and that means several things:
de: Wir arbeiten schwer an diesem Buch und das bedeutet folgendes:

source: **It's not done**. We will be releasing new chapters from time to time and updating existing chapters on the go.
de: **Es ist nicht fertig**. Wir werden neue Kapitel von Zeit zu Zeit hinzufügen und bestehende Kapitel währenddessen auch updaten.

source: **We love your support**. If you find any errors or have suggestions, please use our feedback system (the |issues| links). It will create a new ticket-entry in our ticket system and help us to keep track.
de: **Wir lieben deine Unterstützung**. Wenn du irgendwelche Fehler findest oder Vorschläge hast, verwende bitte unser Feedbacksystem (die |issues| Links). Es wird dann ein neues Ticket im System angelegt und das hilft uns das Problem zu verfolgen.

source: **Be patient.** We are working in our spare time on the book and we depend on the support of our companies and family.
de: **Bitte Geduld haben**. Wir arbeiten in unserer Freizeit an diesem Buch und wir hängen auch stark von der Unterstützung durch unsere Firmen und Familien ab.

source: **Enjoy!**
de: **Viel Spass!**

source: Content
de: Inhalt

source: Chapter Queue
de: Liste der Kapitel

source: The chapter queue are the chapters we are working on. They might be almost ready or in an infante state. Give it a try if you like.
de: Diese Kapitelliste enthält die Kapitel an denen wir gerade arbeiten. Sie könnten fast fertig sein oder in einem sehr frühen Stadium. Probiere es einfach aus.
