Repository: jolly-jump/qmlbook
Catalog: locale/*/LC_MESSAGES/ch01/index.po
Languages: it, pt

source: Meet Qt 5
it: Introduzione a Qt 5
pt: Conheça o framework Qt 5

source: The source code of this chapter can be found in the `assets folder <../../assets>`_.
it: Il codice sorgente associato a questo capitolo è disponibile nella cartella `assets <../../assets>`_.
pt: O código fonte referente a este capítulo pode ser encontrado na `pasta assets <../assets>`_.

source: This book shall provide you a walk through the different aspect of application development using Qt version 5.x. It focuses on the new Qt Quick technology but also provides necessary information of writing C++ back-ends and extension for Qt Quick.
it: Questo libro vuole offrire una panoramica sui diversi aspetti legati allo sviluppo di applicazioni con Qt, versione 5.x. Il libro è incentrato sulla nuova tecnologia di Qt Quick, ma allo stesso tempo fornisce le informazioni necessarie per scrivere back-end in C++, come anche estensioni per Qt Quick.
pt: Este livro traz uma visão geral sobre os diferentes aspectos envolvidos no desenvolvimento de aplicações utilizando o framework Qt versão 5.x. O livro é focado na utilização da nova tecnologia de desenvolvimento de interfaces Qt Quick, porém também traz informações necessárias para codificar em C++ o backend e extensões para suas aplicações Qt Quick.

source: This chapter provides a high level overview of Qt 5. It shows the different application models available for developers and a Qt 5 showcase application to get a sneak preview of things to come. Additionally the chapter aims to provide a wide overview of the Qt 5 content and how to get in touch with the makers of Qt 5.
it: Questo capitolo fornisce una visione d'insieme di Qt 5. Il capitolo mostra sia le varie tipologie di applicazione a disposizione degli sviluppatori che un'applicazione dimostrativa, in modo da fornire un'anteprima degli argomenti che verranno affrontati. Inoltre, il capitolo vuole offrire una panoramica sul contenuto di Qt 5 e mostrare come entrare in contatto con i suoi creatori.
pt: Neste capítulo temos uma visão geral do Qt 5. São mostrados diferentes modelos de aplicações disponíveis para os desenvolvedores e um aplicativo de exemplo para se ter uma ideia do que está por vir nos próximos capítulos. Além disso, este capítulo tem como objetivo dar uma visão geral sobre os conteúdos disponibilizados pelo framework e como entrar em contato com os desenvolvedores do Qt 5.

source: Preface
it: Prefazione
pt: Prefácio

source: History
it: Storia
pt: História

source: Qt 4 has evolved since 2005 and provided a solid ground for thousands of applications and even full desktop and mobile systems. The usage patterns of computer users changed in the recent years. From stationary PCs towards portable notebook and nowadays mobile computers. The classical desktop is more and more replaced with mobile touch-based always connected screens. With it the desktop UX paradigms also changes. Where as in the past Windows UI has dominated the world we spend more time nowadays on other screens with another UI language.
it: Qt 4 ha visto un progresso costante dal 2005, ed ha rappresentato una base solida per migliaia di applicazioni, e persino sistemi desktop e mobile completi.- Negli ultimi anni, gli utenti dei personal computer hanno modificato considerevolmente le proprie abitudini di utilizzo. Dai PC da tavolo si è passati ai notebook portatili e, infine, ai computer tascabili. Il desktop classico viene via via rimpiazzato da schermi portatili, basati sul touch e costantemente connessi. Questi cambiamenti vanno di passo con cambiamenti nella User Experience anche su desktop. Mentre nel passato le interfacce utente di Windows dominavano il mondo, oggigiorno spendiamo più tempo su schermi di altro tipo e interfacce che utilizzano un linguaggio differente.
pt: O Qt 4 evoluiu bastante desde 2005, e, apresenta uma base sólida para milhares de aplicativos e até mesmo sistemas móveis e ambientes gráficos desktop completos. O padrão dos usuários de software mudou bastante nos últimos anos. Dos computadores de mesa para notebooks portáteis e nos dias atuais dispositivos móveis. O clássico desktop está sendo cada vez mais substituído por dispositivos móveis sensíveis ao toque conectados a Internet. Devido a isso, o paradigma de construção de interfaces também muda. Antes o padrão de interface do Windows dominava o mundo, hoje gastamos mais tempo desenvolvendo para outros tipos de dispositivos e telas utilizando geralmente linguagens de construção de interfaces diferentes.

source: Qt 4 was designed to satisfy the desktop world to have a coherent set of UI widgets available on all major platforms. The challenge for Qt users has changed today and it lies more to provide a touch-based user interface for a customer driven user interface and to enable modern user interface on all major desktop and mobile systems. Qt 4.7 started to introduce the Qt Quick technology which allows users to create a set of user interface components from simple elements to achieve a complete new UI, driven by customer demands.
it: Qt 4 è stato disegnato per soddisfare il mondo desktop e per fornire un set di widget per interfacce utente su tutte le maggiori piattaforme. La sfida per gli utenti di Qt oggi è cambiata, e la sfida principale è quella di fornire interfacce utente basate sul touch, i cui requisiti vengono definiti dai clienti, e che devono essere in grado di fornire un'esperienza d'uso moderna su tutti i maggiori sistemi desktop e mobile. Qt 4.7 ha introdotto la tecnologia QtQuick, che permette agli utenti di creare una serie di componenti UI partendo da elementi semplici, per poter così ottenere interfacce utente completamente nuove, definite dalle richieste dei clienti.
pt: O Qt 4 foi desenvolvido com foco no mundo dos desktops, contendo um conjunto de widgets que podem ser utilizados nas principais plataformas. O desafio para os usuários do Qt tem mudado ultimamente. O foco tem se direcionado para o desenvolvimento de interfaces sensíveis ao toque orientadas ao usuário e para o suporte de interfaces modernas compatíveis com as principais plataformas desktop e de sistemas móveis. O Qt versão 4.7 começou a introduzir a tecnologia QtQuick que permite aos usuários criar um conjunto de componentes de interface gráfica a partir de elementos básicos para alcançar uma interface totalmente nova, de acordo com a necessidade do cliente.

source: Qt 5 Focus
it: Il focus di Qt5
pt: Qt5 um novo foco

source: Qt 5 is a complete refreshing of the very successful Qt 4 release. With Qt 4.8, the Qt 4 release is almost 7 years old. It's time to make an amazing toolkit even more amazing. Qt 5 is focused on the following:
it: Qt 5 è una versione completamente rinnovata rispetto alla release di grande successo di Qt 4. Con la versione 4.8, Qt 4 ha ormai 7 anni. Era quindi il momento di rendere un toolkit eccezionale ancora migliore. Qt 5 è incentrato sui seguenti aspetti:
pt: O Qt 5 é uma completa reformatação da versão Qt 4 que foi muito bem sucedida. Com a versão Qt 4.8, a distribuição Qt 4 completou 7 anos de idade. Já era hora de fazer um incrível framework como Qt ainda mais incrível. O Qt 5 se foca nos seguintes aspectos:

source: **Outstanding Graphics**: Qt Quick 2 is based on OpenGL (ES) using a scene graph implementation. The recomposed graphics stack allows a new level of graphic effects combined with an ease of use never seen before in this field.
it: **Grafica eccellente**: Qt Quick 2 si appoggia su OpenGL (ES) e utilizza un'implementazione basata su scene graph. Questa nuova composizione dello stack grafico consente di raggiungere nuovi livelli in termini di effetti grafici, combinati ad una semplicità di utilizzo mai vista prima in questo campo.
pt: **Gráficos marcantes**: A tecnologia Qt Quick 2 é baseada no OpenGL (ES) a partir do uso de uma implementação de um grafo de cena. A pilha gráfica refeita permite um novo nível de efeitos gráficos combinados com uma facilidade de uso jamais vista.

source: **Developer Productivity**: QML and JavaScript are the primary means for UI creation. The back-end will be driven by C++. The split between JavaScript and C++ allows a fast iteration for front-end developers concentrating on creating beautiful user interfaces and back-end C++ developers concentrating on stability, performance and extending the runtime.
it: **Produttività degli sviluppatori**: QML e JavaScript sono gli strumenti principali per la creazione delle UI. Il back-end sarà gestito dal codice in C++. La divisione netta tra JavaScript e C++ consente iterazioni rapide sia per gli sviluppatori front-end, che possono così concentrarsi sulla creazione di interfacce utente eleganti, sia per gli sviluppatori back-end in C++, che si possono concentrare su stabilità, performance ed estensioni del runtime.
pt: **Produtividade**: QML e JavaScript são o foco para a criação de interfaces. A retaguarda ou back-end será escrita em C++. A divisão entre JavaScript e C++ permite uma interação mais fácil entre desenvolvedores front-end que se concentram em criar lindas interfaces de usuário e desenvolvedores back-end que utilizam C++ com foco em estabilidade, desempenho e extensão de funcionalidades.

source: **Cross-platform portability**: With the consolidated Qt Platform Abstraction, it is now possible to port Qt to a wider range of platforms easier and faster. Qt 5 is structured around the concept of Qt Essentials and Add-ons, which allows OS developer to focus on the essentials modules and leads to a smaller runtime altogether.
it: **Portabilità cross-platform**: Con la tecnologia consolidata della Qt Platform Abstraction, è ora possibile portare Qt su una gamma più ampia di piattaforme in maniera più semplice e rapida. Qt 5 si fonda sul concetto di Qt Essentials e di Add-ons, che consente agli sviluppatori OS di concentrarsi sui moduli essenziali e permette inoltre di ottenere dei runtime di dimensioni inferiori.
pt: **Portabilidade entre plataformas**: Com a consolidada Plataforma de Abstração Qt ou Qt Platform Abstraction, agora é possível portar Qt para uma grande variedade de plataformas de maneira mais fácil e rápida. O Qt 5 tem uma estrutura baseada na separação da plataforma em Qt Essentials (módulos essenciais) e Add-ons (módulos extras), o que permite aos desenvolvedores de sistemas operacionais se focar nos módulos essenciais e leva a um menor tempo de execução como um todo.

source: **Open Development**: Qt is now a truly open-governance project hosted at `qt.io <http://qt.io>`_. The development is open and community driven.
it: **Sviluppo Open**: Qt è ora veramente un progetto di tipo open-governance, ospitato su `Qt-Project <http://qt-project.org>`_. Lo sviluppo è open e guidato dalla community.
pt: **Desenvolvimento aberto**: O Qt agora é realmente um projeto aberto hospedado em `Qt-Project <http://qt-project.org>`_. O desenvolvimento é aberto e comandado pela comunidade.

source: Qt 5 Introduction
it: Introduzione a Qt5
pt: Introdução ao Qt5

source: Qt Quick is the umbrella term for the user interface technology used in Qt 5. Qt Quick itself is a collection of several technologies:
it: Qt Quick è il termine onnicomprensivo per la tecnologia dell'interfaccia utente utilizzata in Qt5. Qt Quick di per sé è una collezione di diverse tecnologie:
pt: Qt Quick é o principal componente utilizado para construção de interfaces gráficas com Qt5. O Qt Quick consiste em um conjunto de tecnologias reunidas:

source: QML - Markup language for user interfaces
it: QML - Linguaggio markup per interfacce utente
pt: QML - Linguagem de marcação para criação de interfaces

source: JavaScript - The dynamic scripting language
it: JavaScript - Il linguaggio di scripting dinamico
pt: JavaScript - A linguagem de scripts dinâmica

source: Qt C++ - The highly portable enhanced c++ library
it: Qt C++ - La libreria c++ avanzata altamente portabile
pt: Qt C++ - O conjunto de bibliotecas multiplataforma melhorada

source: Similar to HTML, QML is a markup language. It is composed of tags called elements in Qt Quick enclosed in curly brackets ``Item {}``. It was designed from the ground up for the creation of user interfaces, speed and easier reading for developers. The user interface can be enhanced using JavaScript code. Qt Quick is easily extendable with your own native functionality using Qt C++. In short the declarative UI is called the front-end and the native parts are called the back-end. This allows you to separate the computing intensive and native operation of your application from the user interface part.
it: Similmente ad HTML, QML è un linguaggio di markup. E' costituito da tags che in QtQuick vengono chiamati elementi, i quali vengono racchiusi in parentesi graffe ``Item {}``. E' stato progettato fin dall'origine per la creazione di interfacce utente, per la velocità e per essere di facile lettura per gli sviluppatori. L'interfaccia utente può essere potenziata tramite l'utilizzo di codice JavaScript. Qt Quick è facilmente estendibile con funzionalità native custom tramite Qt C++. Sinteticamente, la UI dichiarativa viene chiamata front-end e le parti native vengono chiamate back-end. La distinzione permette di separare le operazioni native e computazionalmente onerose di un'applicazione dalla parte dell'interfaccia grafica.
pt: Assim como HTML, QML é uma linguagem de marcação. Ela é composta de tags, chamadas de elementos em QtQuick, que são definidas entre chaves ``Item {}``. Ela foi desenvolvida do zero com foco na criação de interfaces de usuários de maneira rápida e fácil. As interfaces criadas podem ser melhoradas a partir do uso de código em JavaScript. O Qt Quick é facilmente extensível a partir do uso de código nativo em C++. Em resumo, a interface gráfica criada com código declarativo é chamada de front-end e a parte desenvolvida com código nativo de back-end. Estes conceitos permitem a separação dos mecanismos de computação intensiva e operações nativas das suas aplicações da parte de desenvolvimento de interfaces.

source: In a typical project the front-end is developed in QML/JavaScript and the back-end code, which interfaces with the system and does the heavy lifting, is developed using Qt C++. This allows a natural split between the more design oriented developers and the functional developers. Typically the back-end is tested using Qt own unit testing framework and exported for the front-end developers to be used.
it: In un progetto tipico, il front-end viene sviluppato in QML/JavaScript, mentre il codice back-end, che si interfaccia col sistema e si occupa del lavoro pesante, viene sviluppato usando Qt C++. Ciò permette una divisione naturale tra gli sviluppatori più orientati al design e gli sviluppatori funzionali. Tipicamente, il back-end viene testato utilizzando il testing framework proprio di Qt, e viene quindi esportato per l'utilizzo da parte degli sviluppatori front-end.
pt: Em um projeto típico, o front-end é desenvolvido em QML/JavaScript e o back-end, que geralmente se comunica com o sistema operacional e realiza o trabalho pesado é desenvolvido em Qt C++. Isso permite uma separação natural entre desenvolvedores voltados para o projeto de interfaces gráficas dos desenvolvedores funcionais. Normalmente o código do back-end é testado utilizando o próprio módulo de testes unitários presente no framework Qt e disponibilizado para que os desenvolvedores front-end possam utilizá-lo.

source: Digesting an User Interface
it: Assimilare un'Interfaccia Utente
pt: Construindo uma Interface de Usuário

source: Let's create a simple user interface using Qt Quick, which showcases some aspects of the QML language. At the end we will have a paper windmill with rotating blades.
it: Usando QtQuick, creeremo ora una semplice interfaccia utente che dimostra alcuni aspetti del linguaggio QML. Il risultato finale sarà una girandola con le pale che ruotano.
pt: Vamos criar uma interface de usuário simples utilizando o QtQuick, demonstrando alguns aspectos da linguagem QML. Vamos construir uma paisagem com um cata-vento que se movimenta.

source: We start with an empty document called ``main.qml``. All QML files will have the ending ``.qml``. As a markup language (like HTML) a QML document needs to have one and only one root element, which in our case is the ``Image`` element with a width and height based on the background image geometry:
it: Cominciamo da un documento vuoto che chiamiamo ``main.qml``. Tutti i file QML conterranno l'estensione ``.qml``. Essendo un linguaggio di markup (come l'HTML) un documento QML deve avere uno e uno solo elemento radice che, nel nostro caso, è l'elemento ``Image``, che ha larghezza e altezza basate sulla geometria dell'immagine di sfondo:
pt: Vamos começar criando um documento vazio chamado ``main.qml``. Todos os arquivos QML devem terminar com a extensão ``.qml``. Como uma linguagem de marcação (assim como HTML), um documento QML deve conter um e somente um elemento raiz, que no nosso caso é o elemento ``Image`` que tem suas dimensões (largura e altura) definida pela imagem exibida por ele:

source: As QML does not make any restriction which element type is the root element we use an ``Image`` element with the source property set to our background image as the root element.
it: Poiché il QML non pone alcun tipo di restrizione sul tipo di elemento che può essere l'elemento radice, utilizziamo un elemento ``Image`` con la proprietà source (sorgente) settata all'immagine di background.
pt: Como QML não apresenta uma limitação quanto ao tipo de elemento que pode ser usado como raiz, nós usamos um elemento ``Image`` com a propriedade ``source`` configurada com o caminho para a imagem de fundo que iremos exibir.

source: Each element has properties, e.g. an image has a ``width``, ``height`` but also other properties like a ``source`` property. The size of the image element is automatically deduced from the image size. Otherwise we would need to set the ``width`` and ``height`` property to some useful pixel values.
it: Ogni elemento ha diverse proprietà, per esempio un'immagine ha le proprietà ``width``, ``height`` come anche altre proprietà, quali ``source``. Le dimensioni dell'elemento Image vengono desunte automaticamente dalle dimensioni dell'immagine sorgente. In alternativa, dovremmo settare le proprietà ``width`` e ``height`` a valori in pixel che siano ragionevoli.
pt: Todo elemento possui propriedades, por exemplo, uma imagem tem uma largura definida pela propriedade ``width``, uma altura definida pela propriedade ``height`` e também outras propriedades como o ``source`` que define o caminho da imagem que será exibida pelo elemento. O tamanho do elemento ``Image`` é automaticamente deduzido a partir das dimensões da imagem exibida. Nós também podemos definir explicitamente os valores para as propriedades ``width`` e ``height`` utilizando medidas em pixels.

source: The most standard elements are located in the ``QtQuick`` module which we include in the first line with the import statement.
it: Gli elementi più comuni sono localizzati nel modulo ``QtQuick`` che abbiamo incluso nella prima riga con la dichiarazione di import.
pt: Os elementos padrões estão localizados no módulo ``QtQuick``, o qual nós incluímos na primeira linha do código a partir da palavra chave ``import``.

source: The ``id`` special property is optional and contains an identifier to reference this element later in other places in the document. Important: An ``id`` property cannot be changed after it has been set and it cannot be set during runtime. Using ``root`` as the id for the root-element is just a habit by the author and makes referencing the top-most element predictable in larger QML documents.
it: La proprietà speciale ``id`` è opzionale e contiene un identificativo per fare riferimento all'elemento in altre sezioni del documento. Importante: Una proprietà ``id`` non può venire modificata dopo che è stata creata, e non può venire settata al runtime. L'utilizzo di ``root`` come id per l'elemento radice è solo un'abitudine dell'autore che permette di fare riferimento all'elemento più in alto nella gerarchia in documenti QML di una certa lunghezza.
pt: A propriedade especial ``id`` é opcional e contém um identificador utilizado para referenciar o elemento a partir de outros trechos de código dentro do documento. Importante: A propriedade ``id`` não pode ser modificada após ser definida e ela não pode ser definida em tempo de execução. Usar ``root`` como o identificador dos elementos raízes é somente uma convenção utilizada pelo autor, que facilita a referência a elementos raízes em arquivos QML maiores.

source: The foreground elements pole and pin wheel of our user interface are placed as separate images.
it: Gli elementi in primo piano dell'interfaccia utente (l'asta e la girandola) sono localizzati in immagini separate.
pt: Os outros elementos da nossa interface, a haste e o cata-vento estão armazenados em imagens separadas.

source: The pole needs to be placed in the horizontal center of the background towards the bottom. And the pinwheel can be placed in the center of the background.
it: L'asta (pole) va posizionata al centro orizontale dello sfondo, verso il basso. E la girandola (pinwheel) va posizionata al centro dello sfondo.
pt: A haste deve ser posicionada centralizada horizontalmente em relação a imagem de fundo, partindo da parte inferior da tela. E o cata-vento pode ser posicionado no centro da tela.

source: Normally your user interface will be composed of many different element types and not only image elements like in this example.
it: Di regola l'interfaccia utente sarà composta da molti elementi di tipo differente, e non solo immagini come in questo esempio.
pt: Normalmente as interfaces de usuários serão compostas de vários tipos diferentes de elementos e não somente de imagens como neste exemplo.

source: To place the pin wheel at the central location we use a complex property called ``anchor``. Anchoring allows you to specify geometric relations between parent and sibling objects. E.g. Place me in the center of another element ( ``anchors.centerIn: parent`` ). There are left, right, top, bottom, centerIn, fill, verticalCenter and horizontalCenter relations on both ends. Sure, they need to match. It does not make sense to anchor my left side to the top side of an element.
it: Per posizionare la girandola al centro utilizziamo una proprietà complessa chiamata ``anchor``. L'ancoraggio permette di specificare relazioni geometriche tra oggetti che hanno relazione padre-figlio e fratelli. Es.: Posizionami al centro di un altro elemento (``anchors.centerIn:parent``). Da entrambe le parti, sono disponibili le seguenti relazioni: left, right, top, bottom, centerIn, fill, verticalCenter e horizontalCenter. E' necessario che le relazioni siano concordanti: per esempio, non ha senso ancorare il lato sinistro (left) di un elemento al lato superiore (top) di un altro elemento.
pt: Para posicionar o cata-vento centralizado em relação a imagem de fundo, utilizamos uma propriedade composta chamada ``anchor`` (âncora). Utilizando âncoras nos permite especificar a localização de elementos utilizando relações entre eles. Por exemplo, para posicionar um elemento de forma centralizada em relação a posição de outro elemento utilizamos ( ``anchors.centerIn: parent`` ). Também podemos usar as propriedades ``left`` (esquerda), ``right`` (direita), ``top`` (cima), ``bottom`` (em baixo), ``centerIn`` (centralizar), ``fill`` (preencher), ``verticalCenter`` (centro vertical) e ``horizontalCenter`` (centro horizontal). Temos que tomar cuidado para utilizar relações que fazem sentido, por exemplo, não podemos ancorar a lateral esquerda de um elemento (``left``) com a posição superior (``top``) de outro.
