Repository: jolly-jump/qmlbook
Catalog: locale/*/LC_MESSAGES/ch01/index.po
Languages: it, pt

source: So we set the pinwheel to be centered in the parent our background.
it: Quindi, andiamo a settare la girandola come centrata rispetto al genitore (parent), l'immagine di sfondo.
pt: Assim, nós posicionamos o cata-vento no centro da imagem de fundo.

source: Sometime you will need to make small adjustments on the exact centering. This would be possible with ``anchors.horizontalCenterOffset`` or with ``anchors.verticalCenterOffset``. Similar adjustments properties are also available to all the other anchors. Please consult the documentation for a full list of anchors properties.
it: A volte sarà necessario effettuare piccoli aggiustamenti rispetto alla centratura esatta. Questa operazione è resa possibile dalle proprietà ``anchors.horizontalCenterOffset`` e ``anchors.verticalCenterOffset``. Proprietà di aggiustamento simili sono disponibili anche per tutti gli altri punti di ancoraggio. Per una lista completa delle proprietà di ancoraggio, consultare la documentazione.
pt: Algumas vezes você pode precisar fazer pequenos ajustes ou desvios em relação a posição centralizada original. Isso pode ser feito a partir do uso das propriedades ``anchors.horizontalCenterOffset`` ou ``anchors.verticalCenterOffset``. Ajustes similares podem ser feitos em relação aos outros tipos de âncoras. Consulte a documentação para ver a lista completa de propriedades que podem ser ajustadas a partir do uso da propriedade ``anchors``.

source: Placing an image as a child element of our root element (the ``Image`` element) shows an important concept of a declarative language. You describe the user interface in the order of layers and grouping, where the topmost layer (our rectangle) is drawn first and the child layers are drawn on top of it in the local coordinate system of the containing element.
it: Posizionare un'immagine come elemento figlio del rettangolo radice mostra un aspetto importante dei linguaggi dichiarativi. L'interfaccia utente viene descritta seguendo l'ordine di livelli e gruppi, dove il livello più alto (il nostro rettangolo) è il primo ad essere disegnato, mentre i livelli figli vengono disegnati davanti ad esso, secondo il sistema di coordinate locale dell'elemento contenitore.
pt: Utilizar uma imagem como um elemento filho do nosso elemento raiz demonstra um conceito importante presente em linguagens declarativas. Você descreve a interface de usuário baseado em camadas e agrupamento, onde a camada superior (nossa imagem de fundo) é desenhada antes e as camadas filhas são desenhadas por cima dela, utilizando o sistema de coordenadas definido pelo elemento que as contém.

source: To make the showcase a little bit more interesting, we would like to make the scene interactive. The idea is to rotate the wheel when the user pressed the mouse somewhere in the scene.
it: Per rendere questa dimostrazione più interessante, potremmo ora rendere la scena interattiva. L'idea è quella di rotare la girandola quando l'utente preme il tasto del mouse da qualche parte nella scena.
pt: Para tornar o nosso exemplo um pouco mais interessante, vamos adicionar um pouco de interatividade ao nosso aplicativo. A ideia é de rotacionar o cata-vento quando o usuário clicar no cenário.

source: We use the ``MouseArea`` element and make it as big as our root element.
it: Per fare questo, utilizziamo l'elemento ``MouseArea`` e gli attribuiamo le stesse dimensioni dell'elemento radice.
pt: Nós utilizamos o elemento ``MouseArea`` e fazemos com que ele cubra toda a imagem de fundo.

source: The mouse area emit signals when a user clicks inside it covered area. You can hook onto this signal overriding the ``onClicked`` function. In this case the reference the wheel image and change its rotation by +90 degree.
it: L'area del mouse emette dei segnali (signals) quando l'utente clicca al suo interno. E' possibile intercettare questo segnale sovrascrivendo la funzione ``onClicked``. Nel caso specifico, facciamo riferimento alla girandola e ne modifichiamo la rotazione di +90 gradi.
pt: O elemento ``MouseArea`` emite sinais quando um usuário clica sobre a área que ele está posicionado. Nós podemos então reagir a este evento atribuindo uma função para a propriedade ``onClicked``. Neste caso, nós referenciamos a imagem do cata-vento e modificamos sua rotação em 90 graus no sentido horário (+90).

source: This works for every signal, the naming is ``on`` + ``SignalName`` in title cases. Also all properties emit a signal when their value changed. The naming is:
it: Questo meccanismo funziona per ogni segnale, la convenzione per il nome della funzione è ``on`` + ``NomeDelSegnale``. Inoltre, tutte le proprietà emettono un segnale una volta che il loro valore è cambiato. La convenzione per il nome è:
pt: A nomenclatura ``on`` + ``NomeDoSinal`` é utilizada para todos os sinais. Outro aspecto é que todas as propriedades emitem sinais quando tem seu valor alterado. A nomenclatura neste caso é:

source: ``on`` + ``PropertyName`` + ``Changed``
it: ``on`` + ``NomeProprietà`` + ``Changed``
pt: ``on`` + ``NomeDaPropriedade`` + ``Changed``

source: If a ``width`` property is changing you can observe it with ``onWidthChanged: print(width)`` for example.
it: Per esempio, se una proprietà ``width`` cambia, è possibile osservarla con ``onWidthChanged: print(width)``.
pt: Por exemplo, você pode monitorar mudanças na propriedade ``width`` utilizando ``onWidthChanged: print(width)``.

source: Now the wheel will rotate, but it is still not fluid yet. The rotation property changes immediately. What we would like that the property changes by 90 degree over time. Now animations come into play. An animation defines how a property change is distributed over a duration. To enable this we use an animation type called property behavior. The ``Behaviour`` does specify an animation for a defined property for every change applied to that property. In short every time the property changes, the animation is run. This is only one of several ways of declaring an animation in QML.
it: Ora la girandola ruota, ma non in modo fluido. La proprietà rotation cambia immediatamente. Invece, vorremmo che la proprietà cambiasse di 90 gradi in un arco di tempo. A questo punto entrano in gioco le animazioni. Un'animazione definisce come il cambio di una proprietà debba essere distribuito lungo un periodo di tempo. Per abilitare questo comportamento, utilizziamo un tipo di animazione chiamato property behavior. Il ``Behaviour`` (comportamento) specifica un'animazione per una certa proprietà che si applica ad ogni cambiamento di quella proprietà. In breve, ogni volta che la proprietà cambia, l'animazione viene lanciata. Questo è solo uno dei tanti modi che esistono per dichiarare un'animazione in QML.
pt: Agora o cata-vento irá se mexer, mas de forma brusca. A propriedade de rotação é modificada imediatamente após o clique. O que nós queremos é que o catavento rotacione 90 graus de forma suavizada durante um período de tempo. É aí que o uso de animações se torna útil. Uma animação define de que forma mudanças em uma propriedade são distribuídas durante um intervalo de tempo. Para habilitar este comportamento nós utilizamos um tipo de animação chamado ``property behavior``. A palavra chave ``Behaviour`` especifica uma animação para uma propriedade que será aplicada toda vez que esta sofrer uma alteração de valor. Em resumo, toda vez que uma propriedade é alterada, a animação é executada. Esta é uma das diversas maneiras que podemos declarar uma animação em QML.

source: Now whenever the property rotation of the wheel changes it will be animated using a ``NumberAnimation`` with a duration of 250 ms. So each 90 degree turn will take 250 ms.
it: Ora, ogniqualvolta la proprietà rotation della girandola cambia, essa verrà animata utilizzando una ``NumberAnimation`` della durata di 250 ms. Ovvero, ogni rotazione di 90 gradi impiegherà 250 ms.
pt: Agora quando a propriedade ``rotation`` do cata-vento for alterada ela será animada utilizando um ``NumberAnimation`` com uma duração de 250 ms. Então cada rotação de 90 graus levará 250 ms.

source: You will not actually see the wheel blurred. This is just to indicate the rotation. But a blurred wheel is in the assets folder. Maybe you want to try to use that.
it: In realtà, la girandola non apparirà sfocata. Lo sfocamento serve solo ad indicare la rotazione. Tuttavia, nella cartella degli assets è presente una girandola sfocata. Forse vuoi provare ad utilizzarla.
pt: Você não verá o cata-vento distorcido como mostrado na imagem. A imagem está desta maneira somente para indicar o movimento de rotação. Porém existe uma imagem com este efeito no diretório ``assets``. Talvez você queira utilizá-la.

source: Now the wheel looks already much better. I hope this has given you a short idea of how Qt Quick programming works.
it: Ora la girandola ha già un aspetto molto migliore. Spero che questo esempio ti abbia dato una prima impressione di come funzioni la programmazione in Qt Quick.
pt: Agora o cata-vento está muito melhor. Espero que este exemplo tenha proporcionado uma pequena noção sobre como a programação com Qt Quick funciona.

source: Qt Building Blocks
it: Gli ingredienti di Qt
pt: A Estrutura do Qt

source: Qt 5 consists of a large amount of modules. A module in general is a library for the developer to use. Some modules are mandatory for a Qt enabled platform. They form a set called *Qt Essentials Modules*. Many modules are optional and form the *Qt Add-On Modules*. It's expected that the majority of developers will not have the need to use them, but it's good to know them as they provide invaluable solutions to common challenges.
it: Qt 5 consiste di una grande quantità di moduli. Generalmente, un modulo è una libreria che può essere utilizzata dallo sviluppatore. Alcuni moduli sono obbligatori per ogni piattaforma che supporta Qt. Tali moduli formano un insieme chiamato *Qt Essentials Modules*. Molti moduli sono opzionali e formano i *Qt Add-On Modules*. E' probabile che la maggior parte degli sviluppatori non abbia bisogno di tali moduli, ma conoscerli è buona cosa in quanto essi forniscono soluzioni egregie a problemi ricorrenti.
pt: O Qt 5 é estruturado em um grande conjunto de módulos. Um módulo consiste de uma biblioteca que pode ser utilizada pelos desenvolvedores. Alguns módulos são essenciais para o funcionamento do framework em uma plataforma. Eles formam um conjunto que chamamos de *Módulos Qt Essentials*. Já, outros módulos são opcionais e formam o que chamamos de *Módulos Qt Addon*. Normalmente a maioria dos desenvolvedores não precisam usar estes módulos, porém é bom saber que eles apresentam recursos adicionais que podem ser de grande ajuda em alguns casos.

source: Qt Modules
it: I moduli Qt
pt: Módulos Qt

source: The Qt Essentials modules are mandatory for a Qt enabled platform. They offer the foundation to develop a modern Qt 5 Application using Qt Quick 2.
it: I Qt Essentials modules sono obbligatori per ogni piattaforma che supporta Qt. Essi forniscono le basi per sviluppare un'applicazione Qt 5 moderna utilizzando Qt Quick 2.
pt: Os módulos presentes na categoria ``Qt Essentials`` são essenciais para que o framework funcione em uma plataforma. Eles fornecem a base para desenvolver aplicações modernas utilizando o Qt 5 e a tecnologia Qt Quick 2.

source: The minimal set of Qt 5 modules to start QML programming.
it: Il set minimo di moduli Qt 5 per iniziare la programmazione in QML.
pt: O conjunto mínimo de módulos do framework Qt 5 necessários para programar utilizando QML.

source: Module
it: Modulo
pt: Módulo

source: Description
it: Descrizione
pt: Descrição

source: Core non-graphical classes used by other modules
it: Le classi fondamentali non grafiche utilizzate dagli altri moduli
pt: Classes do núcleo não relacionadas com tarefas gráficas que são utilizadas pelos outros módulos.

source: Base classes for graphical user interface (GUI) components. Includes OpenGL.
it: Classi base per componenti di interfaccia grafica utente (GUI). Include OpenGL.
pt: Classes base para construção de componentes de interfaces gráficas. Inclui OpenGL.

source: Classes for audio, video, radio and camera functionality.
it: Classi per funzionalità audio, video, radio e camera.
pt: Classes para manipulação de áudio, vídeo, rádio e câmera.

source: Classes to make network programming easier and more portable.
it: Classi che rendono la programmazione di rete più semplice e portabile.
pt: Classes que tornam a utilização de comunicação em rede mais fácil e portável.

source: Classes for QML and JavaScript languages.
it: Classi per i linguaggi QML e JavaScript.
pt: Classes base para as linguagens QML e JavaScript.

source: declarative framework for building highly dynamic applications with custom user interfaces.
it: Framework dichiarativo per la costruzione di applicazioni altamente dinamiche con interfacce utente personalizzate.
pt: Framework declarativo que permite a construção de aplicações altamente dinâmicas com interfaces de usuário personalizadas.

source: Classes for database integration using SQL.
it: Classi per l'integrazione di database utilizzando SQL.
pt: Classes utilizadas para integração de banco de dados utilizando SQL.

source: Classes for unit testing Qt applications and libraries.
it: Classi per lo unit testing di applicazioni e librerie Qt.
pt: Classes para construção de testes unitários para aplicações e bibliotecas que utilizam o framework Qt.

source: Classes for a WebKit2 based implementation and a new QML API. See also Qt WebKit Widgets in the add-on modules.
it: Classi per un'implementazione basata su WebKit2 ed una nuova API in QML. Vedi anche Qt WebKit Widgets nei moduli add-on.
pt: Classes para implementação do WebKit2 e sua API QML. Veja também o módulo ``Qt WebKit Widgets``.

source: WebKit1 and QWidget-based classes from Qt 4.
it: Classi di Qt 4 basate su WebKit1 e QWidget.
pt: Classes para implementação do WebKit1 e suas classes baseadas no QWidget para o Qt 4.

source: Classes to extend Qt GUI with C++ widgets.
it: Classi per estendere Qt GUI con widget C++.
pt: Classes que extendem o módulo Qt GUI com widgets C++.

source: Qt Addon Modules
it: Moduli Addon Qt
pt: Módulos Qt Addon

source: Besides the essential modules, Qt offers additional modules for software developers, which are not part of the release. Here is a short list of add-on modules available.
it: Oltre ai moduli essenziali, Qt offre agli sviluppatori software moduli addizionali che non fanno parte della distribuzione. Ecco un breve elenco di moduli addizionali disponibili.
pt: Além dos módulos essenciais, o Qt oferece módulos adicionais para os desenvolvedores, que não fazem parte da distribuição básica. Segue uma breve lista de módulos adicionais disponíveis.

source: Qt 3D - A set of APIs to make 3D graphics programming easy and declarative.
it: Qt 3D - Una serie di API che rendono la programmazione grafica 3D semplice e dichiarativa.
pt: Qt 3D - Um conjunto de APIs que permitem programar gráficos 3D de forma fácil e declarativa.

source: Qt Bluetooth - C++ and QML APIs for platforms using Bluetooth wireless technology.
it: Qt Bluetooth - API in C++ e QML per piattaforme che utilizzano la tecnologia wireless Bluetooth.
pt: Qt Bluetooth - APIs C++ e QML para utilizar a tecnologia Bluetooth.

source: Qt Contacts - C++ and QML APIs for accessing addressbooks / contact databases
it: Qt Contacts - API in C++ e QML per accedere alle rubriche e ai database dei contatti.
pt: Qt Contacts - APIs C++ e QML para acessar lista de endereços e contatos.

source: Qt Location - Provides location positioning, mapping, navigation and place search via QML and C++ interfaces. NMEA backend for positioning
it: Qt Location - Mette a disposizione posizionamento, mappe, navigazione e ricerca dei luoghi tramite interfacce QML e C++. back-end NMEA per il posizionamento
pt: Qt Location - Permite a utilização de funcionalidades de localização, posicionamento, mapas, navegação através de interfaces QML e C++. Backend NMEA para posicionamento

source: Qt Organizer - C++ and QML APIs for accessing organizer events (todos, events, etc.)
it: Qt Organizer - API in C++ e QML per accedere agli eventi dell'agenda (memo, eventi, etc.).
pt: Qt Organizer - APIs C++ e QML para acessar organizadores de eventos (todos, events, etc.)

source: Qt Sensors - Access to sensors via QML and C++ interfaces.
it: Qt Sensors - Accesso ai sensori tramite interfacce QML e C++.
pt: Qt Sensors - Acesso a sensores através de interfaces QML e C++.

source: Qt Service Framework - Enables applications to read, navigate and subscribe to change notifications.
it: Qt Service Framework - Permette alle applicazioni di leggere, sfogliare e sottoscrivere notifiche di cambiamento.
pt: Qt Service Framework - Permite as aplicações ler, navegar e escutar notificações de mundança entre processos.

source: Qt System Info - Discover system related information and capabilities.
it: Qt System Info - Per accedere alle informazioni e capacità del sistema.
pt: Qt System Info - Permite acessar informações relacionadas com o sistema e seus recursos.

source: Qt Versit - Support for vCard and iCalendar formats
it: Qt Versit - Supporto per i formati vCard e iCalendar.
pt: Qt Versit - Suporte para os formatos vCard e iCalendar.

source: Qt Wayland - Linux only. Includes Qt Compositor API (server), and Wayland platform plugin (clients)
it: Qt Wayland - Solo per Linux. Include l'API Qt Compositor (server), e il plugin per piattaforme Wayland (clients).
pt: Qt Wayland - Somente para Linux. Inclui a API ``Qt Compositor`` (servidor), e plugin para a plataforma Wayland (clientes).

source: Qt Feedback - Tactile and audio feedback to user actions.
it: Qt Feedback - Riscontro tattile e audio alle azioni degli utenti.
pt: Qt Feedback - Respostas táteis e sonoras para ações de usuarios.

source: Qt JSON DB - A no-SQL object store for Qt.
it: Qt JSON DB - Un sistema di immagazzinamento dati non basato su SQL.
pt: Qt JSON DB - Armazenamento no-SQL para objetos.

source: As these modules are not part of the release the state differ between modules, depending how many contributors are active and how well it's get tested.
it: Poiché questi moduli non fanno parte della distribuzione, il loro stato varia, a seconda di quanti contributori siano attivi e di quanto vengano testati.
pt: Como estes módulos não fazem parte da distribuição principal, seus status de desenvolvimento são diferentes, variando de acordo com a quantidade de desenvolvedores que contribuem para sua manutenção e teste.

source: Supported Platforms
it: Piattaforme Supportate
pt: Plataformas suportadas

source: Qt supports a variety of platforms. All major desktop and embedded platforms are supported. Through the Qt Application Abstraction, nowadays it's easier to port Qt over to your own platform if required.
it: Qt supporta numerose piattaforme. Tutte le maggiori piattaforme sia desktop che embedded sono supportate. Tramite la Qt Application Abstraction, oggi risulta più semplice portare Qt sulla tua piattaforma, se necessario.
pt: O Qt suporta uma grande variedade de plataformas. As principais plataformas desktop e embarcadas são suportadas. Através do ``Qt Application Abstraction``, atualmente portar Qt para outras plataformas é uma tarefa mais fácil.

source: Testing Qt 5 on a platform is time consuming. A sub-set of platforms was selected by the Qt Project to build the reference platforms set. These platforms are thoroughly tested through the system testing to ensure the best quality. Mind you though: no code is error free.
it: Testare Qt 5 su una piattaforma è dispendioso in termini di tempo. Un sottoinsieme delle piattaforme è stato selezionato dal qt-project per costituire il gruppo delle piattaforme di riferimento. Queste piattaforme vengono testate approfonditamente per assicurarne la qualità. Ma attenzione: non esiste codice completamente privo di errori.
pt: Testar o Qt 5 em uma plataforma é uma tarefa que leva bastante tempo. Um subconjunto de plataformas foi selecionado pelo projeto Qt para compor o conjunto de plataformas referência. Estas plataformas são altamente testadas, o que garante um bom nível de qualidade. Mas ponha na sua mente: nenhum código é livre de erros.

source: Qt Project
it: Il Qt Project

source: From the `Qt Project wiki <http://wiki.qt.io/>`_:
it: Dalla `wiki del qt-project <http://wiki.qt-project.org>`_:
pt: Extraído de `qt-project wiki <http://wiki.qt-project.org>`_:

source: "The Qt Project is a meritocratic consensus-based community interested in Qt. Anyone who shares that interest can join the community, participate in its decision making processes, and contribute to Qt’s development."
it: "Il Qt Project è una community meritocratica e basata sul consenso interessata a Qt. Chiunque sia interessato può unirsi alla community, partecipare ai processi decisionali, e contribuire allo sviluppo di Qt."
pt: "O Qt Project é uma comunidade meritocrática baseada no consenso composta por pessoas interessadas no framework Qt. Qualquer um que compartilha deste interesse pode se juntar a comunidade, participar nos seus processos de decisões, e contribuir para o desenvolvimento do Qt."

source: The Qt Project is an organisation which developes the open-source part of the Qt further. It forms the base for other users to contribute. The biggest contributor is DIGIA, which holds also the comercial rights to Qt.
it: Il Qt-Project è un'organizzazione che porta avanti lo sviluppo della parte open-source di Qt. Costituisce la base a cui altri utenti possono contribuire. Il contributore maggiore è DIGIA, che detiene anche i diritti commerciali di Qt.
pt: O Qt-Project é a organização que mais contribui para o desenvolvimento da parte de código livre do framework Qt. Ela forma a base para outros usuários contribuírem. O maior contribuidor é a DIGIA, que detém os direitos comerciais sobre o Qt.

source: Qt has an open-source aspect and a comercial aspect for companies. The comercial aspect is for companies which can not or will not comply with the open-source licenses. Without the comercial aspect these companies would not be able to use Qt and it would not allow DIGIA to contribute so much code to the Qt Project.
it: Qt ha un lato open-source e un lato commerciale. Il lato commerciale è riservato a quelle aziende che non soddisfano le licenze di tipo open-source. Senza l'aspetto commerciale, queste aziende non sarebbero in grado di usare Qt, e DIGIA non sarebbe in grado di contribuire con così tanto codice al Qt-Project.
pt: O Qt pode ser utilizado sob a licença de código livre ou comercial. A licença comercial é utilizada por empresas que não podem ou não vão cumprir com os deveres da licença de código livre. Sem a licença comercial estas empresas não poderão utilizar o Qt devidamente, o que não permitiria a DIGIA contribuir tanto para o código do Qt-Project.
